InformationRegisters/УдалитьВредныеФакторыИВидыРаботПозицииШтатногоРасписания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>УдалитьВредныеФакторыИВидыРаботПозицииШтатногоРасписания</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВредныйФактор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УдалитьВредныеФакторыИВидыРаботПозицииШтатногоРасписания/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьПрежнийНаборЗаписей();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	МедицинскиеОсмотры.ОбновитьЗависимыеДанныеПоНаборуВредныхФакторовВидовРабот(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СохранитьПрежнийНаборЗаписей()
	
	Если Отбор["РабочееМесто"].Использование = Ложь Или Не ЗначениеЗаполнено(Отбор.РабочееМесто.Значение) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РабочееМесто", Отбор.РабочееМесто.Значение);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеНабора.РабочееМесто КАК РабочееМесто,
		|	ДанныеНабора.ВредныйФактор КАК ВредныйФактор
		|ИЗ
		|	РегистрСведений.УдалитьВредныеФакторыИВидыРаботПозицииШтатногоРасписания КАК ДанныеНабора
		|ГДЕ
		|	ДанныеНабора.РабочееМесто = &РабочееМесто";
	
	ДополнительныеСвойства.Вставить("ПрежнийНабор", Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
